<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Web 缓存 | 草 + 酱</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="什么是Web缓存
Web缓存是指一个Web资源（如html页面，图片，js，数据等）存在于Web服务器和客户端（浏览器）之间的副本。缓存会根据进来的请求保存输出内容的副本；当下一个请求来到的时候，如果是相同的URL，缓存会根据缓存机制决定是直接使用副本响应访问请求，还是向源服务器再次发送请求。比较常见的就是浏览器会缓存访问过网站的网页，当再次访问这个URL地址的时候，如果网页没有更新，就不会再次下">
<meta property="og:type" content="article">
<meta property="og:title" content="Web 缓存">
<meta property="og:url" content="http://yoursite.com/2016/12/06/Web-缓存/index.html">
<meta property="og:site_name" content="草 + 酱">
<meta property="og:description" content="什么是Web缓存
Web缓存是指一个Web资源（如html页面，图片，js，数据等）存在于Web服务器和客户端（浏览器）之间的副本。缓存会根据进来的请求保存输出内容的副本；当下一个请求来到的时候，如果是相同的URL，缓存会根据缓存机制决定是直接使用副本响应访问请求，还是向源服务器再次发送请求。比较常见的就是浏览器会缓存访问过网站的网页，当再次访问这个URL地址的时候，如果网页没有更新，就不会再次下">
<meta property="og:image" content="http://yoursite.com/images/缓存相关http消息报头.png">
<meta property="og:updated_time" content="2017-02-15T03:18:01.359Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Web 缓存">
<meta name="twitter:description" content="什么是Web缓存
Web缓存是指一个Web资源（如html页面，图片，js，数据等）存在于Web服务器和客户端（浏览器）之间的副本。缓存会根据进来的请求保存输出内容的副本；当下一个请求来到的时候，如果是相同的URL，缓存会根据缓存机制决定是直接使用副本响应访问请求，还是向源服务器再次发送请求。比较常见的就是浏览器会缓存访问过网站的网页，当再次访问这个URL地址的时候，如果网页没有更新，就不会再次下">
<meta name="twitter:image" content="http://yoursite.com/images/缓存相关http消息报头.png">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/css/style.css">
  <script src="http://libs.baidu.com/jquery/1.9.0/jquery.js"></script>
</head>
<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<div class="profilepic">
			<img src="/avatar.jpg">
		</div>

		<hgroup>
		  <h1 class="header-author"><a href="/">草 + 酱</a></h1>
		</hgroup>

		
		<p class="header-subtitle">如果说真实是残酷的，谎言绝对是温柔的吧。</p>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">所有文章</a></li>
				        
							<li><a href="/projects">项目</a></li>
				        
							<li><a href="/about">关于</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="https://github.com/Ariel-Cheng" title="github">github</a>
					        
								<a class="weibo" target="_blank" href="http://weibo.com/u/3267066875/" title="weibo">weibo</a>
					        
						</div>
					</nav>
				</section>
				
			</div>
		</div>
	</header>		
</span>		
</div>
    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay"></div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				<img src="/avatar.jpg">
			</div>

			<hgroup>
			  <h1 class="header-author"><a href="/">草 + 酱</a></h1>
			</hgroup>
			
			<p class="header-subtitle">如果说真实是残酷的，谎言绝对是温柔的吧。</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/projects">项目</a></li>
		        
					<li><a href="/about">关于</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/Ariel-Cheng" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="http://weibo.com/u/3267066875/" title="weibo">weibo</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>
      <article id="post-Web-缓存" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/12/06/Web-缓存/" class="article-date">
  	<time datetime="2016-12-06T13:36:59.000Z" itemprop="datePublished">Dec 06</time>
</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/缓存-cache/">缓存 cache</a></li></ul>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      Web 缓存
    </h1>
  

        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
      
        <div class="toc-container">
          <strong class="toc-title">文章目录</strong>
          <ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#什么是web缓存"><span class="toc-number">1.</span> <span class="toc-text">什么是Web缓存</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#web缓存的作用"><span class="toc-number">2.</span> <span class="toc-text">Web缓存的作用</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#web缓存的类型"><span class="toc-number">3.</span> <span class="toc-text">Web缓存的类型</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#浏览器端缓存"><span class="toc-number">4.</span> <span class="toc-text">浏览器端缓存</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#缓存原理"><span class="toc-number">4.1.</span> <span class="toc-text">缓存原理</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#相关http消息报头"><span class="toc-number">4.2.</span> <span class="toc-text">相关HTTP消息报头</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#哪些请求不能被缓存"><span class="toc-number">4.3.</span> <span class="toc-text">哪些请求不能被缓存</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#manifest-localstorage"><span class="toc-number">5.</span> <span class="toc-text">manifest && localStorage</span></a></li></ol>
        </div>      
      
        <h3 id="&#x4EC0;&#x4E48;&#x662F;web&#x7F13;&#x5B58;"><a href="#&#x4EC0;&#x4E48;&#x662F;Web&#x7F13;&#x5B58;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;Web&#x7F13;&#x5B58;"></a>&#x4EC0;&#x4E48;&#x662F;Web&#x7F13;&#x5B58;</h3><blockquote>
<p>Web&#x7F13;&#x5B58;&#x662F;&#x6307;&#x4E00;&#x4E2A;Web&#x8D44;&#x6E90;&#xFF08;&#x5982;html&#x9875;&#x9762;&#xFF0C;&#x56FE;&#x7247;&#xFF0C;js&#xFF0C;&#x6570;&#x636E;&#x7B49;&#xFF09;&#x5B58;&#x5728;&#x4E8E;Web&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x526F;&#x672C;&#x3002;&#x7F13;&#x5B58;&#x4F1A;&#x6839;&#x636E;&#x8FDB;&#x6765;&#x7684;&#x8BF7;&#x6C42;&#x4FDD;&#x5B58;&#x8F93;&#x51FA;&#x5185;&#x5BB9;&#x7684;&#x526F;&#x672C;&#xFF1B;&#x5F53;&#x4E0B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x6765;&#x5230;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x76F8;&#x540C;&#x7684;URL&#xFF0C;&#x7F13;&#x5B58;&#x4F1A;&#x6839;&#x636E;&#x7F13;&#x5B58;&#x673A;&#x5236;&#x51B3;&#x5B9A;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x526F;&#x672C;&#x54CD;&#x5E94;&#x8BBF;&#x95EE;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD8;&#x662F;&#x5411;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x5C31;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x7F13;&#x5B58;&#x8BBF;&#x95EE;&#x8FC7;&#x7F51;&#x7AD9;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x5F53;&#x518D;&#x6B21;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;URL&#x5730;&#x5740;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x9875;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x4E0B;&#x8F7D;&#x7F51;&#x9875;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x7684;&#x7F51;&#x9875;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x7F51;&#x7AD9;&#x660E;&#x786E;&#x6807;&#x8BC6;&#x8D44;&#x6E90;&#x5DF2;&#x7ECF;&#x66F4;&#x65B0;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x624D;&#x4F1A;&#x518D;&#x6B21;&#x4E0B;&#x8F7D;&#x7F51;&#x9875;&#x3002;&#x81F3;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x5668;&#x662F;&#x5982;&#x4F55;&#x6807;&#x8BC6;&#x7F51;&#x7AD9;&#x9875;&#x9762;&#x662F;&#x5426;&#x66F4;&#x65B0;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5C06;&#x5728;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#x3002;</p>
</blockquote>
<a id="more"></a>
<h3 id="web&#x7F13;&#x5B58;&#x7684;&#x4F5C;&#x7528;"><a href="#Web&#x7F13;&#x5B58;&#x7684;&#x4F5C;&#x7528;" class="headerlink" title="Web&#x7F13;&#x5B58;&#x7684;&#x4F5C;&#x7528;"></a>Web&#x7F13;&#x5B58;&#x7684;&#x4F5C;&#x7528;</h3><ol>
<li>&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x6D88;&#x8017;:&#x5F53;Web&#x7F13;&#x5B58;&#x526F;&#x672C;&#x88AB;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x53EA;&#x4F1A;&#x4EA7;&#x751F;&#x6781;&#x5C0F;&#x7684;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7684;&#x964D;&#x4F4E;&#x8FD0;&#x8425;&#x6210;&#x672C;&#x3002;&#x6570;&#x5B57;&#x8BBE;&#x5907;&#x4E2D;&#xFF0C;&#x5E26;&#x5BBD;&#x6307;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x80FD;&#x901A;&#x8FC7;&#x94FE;&#x8DEF;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x901A;&#x5E38;&#x4EE5;bps&#x6765;&#x8868;&#x793A;&#xFF0C;&#x6BCF;&#x79D2;&#x53EF;&#x4F20;&#x8F93;&#x4E4B;&#x4F4D;&#x6570;&#x3002;</li>
<li>&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x5668;&#x538B;&#x529B;:&#x7ED9;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x8BBE;&#x5B9A;&#x6709;&#x6548;&#x671F;&#x4E4B;&#x540E;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x51CF;&#x5C11;&#x5BF9;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x95F4;&#x63A5;&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x722C;&#x866B;&#x673A;&#x5668;&#x4EBA;&#x4E5F;&#x80FD;&#x6839;&#x636E;&#x8FC7;&#x671F;&#x673A;&#x5236;&#x964D;&#x4F4E;&#x722C;&#x53D6;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x4E5F;&#x80FD;&#x6709;&#x6548;&#x964D;&#x4F4E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#x3002;</li>
<li>&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x52A0;&#x5FEB;&#x9875;&#x9762;&#x6253;&#x5F00;&#x901F;&#x5EA6;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x4F53;&#x9A8C;&#x3002;</li>
</ol>
<h3 id="web&#x7F13;&#x5B58;&#x7684;&#x7C7B;&#x578B;"><a href="#Web&#x7F13;&#x5B58;&#x7684;&#x7C7B;&#x578B;" class="headerlink" title="Web&#x7F13;&#x5B58;&#x7684;&#x7C7B;&#x578B;"></a>Web&#x7F13;&#x5B58;&#x7684;&#x7C7B;&#x578B;</h3><p>&#x5728;Web&#x5E94;&#x7528;&#x9886;&#x57DF;&#xFF0C;Web&#x7F13;&#x5B58;&#x5927;&#x81F4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;</p>
<ol>
<li><p>&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x7F13;&#x5B58;&#xFF1A;Web&#x5E94;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x662F;SNS&#x7C7B;&#x578B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5F80;&#x5F80;&#x5173;&#x7CFB;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7E41;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x9891;&#x7E41;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x582A;&#x91CD;&#x8377;&#x3002;&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x67E5;&#x8BE2;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x4F1A;&#x5C06;&#x67E5;&#x8BE2;&#x540E;&#x7684;&#x6570;&#x636E;&#x653E;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#xFF0C;&#x4E0B;&#x6B21;&#x67E5;&#x8BE2;&#x65F6;&#xFF0C;&#x76F4;&#x63A5;&#x4ECE;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#xFF0C;&#x63D0;&#x4F9B;&#x54CD;&#x5E94;&#x6548;&#x7387;&#x3002;&#x6BD4;&#x5982;&#x5E38;&#x7528;&#x7684;&#x7F13;&#x5B58;&#x65B9;&#x6848;&#x6709;memcached&#x7B49;&#x3002;  </p>
</li>
<li><p>&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7F13;&#x5B58;</p>
<p>&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x7F13;&#x5B58;:&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4E2D;&#x95F4;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5148;&#x5411;&#x8FD9;&#x4E2A;&#x4E2D;&#x95F4;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x8D77;Web&#x8BF7;&#x6C42;&#xFF0C;&#x7ECF;&#x8FC7;&#x5904;&#x7406;&#x540E;&#xFF08;&#x6BD4;&#x5982;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#xFF0C;&#x7F13;&#x5B58;&#x5339;&#x914D;&#x7B49;&#xFF09;&#xFF0C;&#x518D;&#x5C06;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x5230;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x7F13;&#x5B58;&#x7684;&#x8FD0;&#x4F5C;&#x539F;&#x7406;&#x8DDF;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x8FD0;&#x4F5C;&#x539F;&#x7406;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x53EA;&#x662F;&#x89C4;&#x6A21;&#x66F4;&#x5927;&#x3002;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x7F13;&#x5B58;&#xFF0C;&#x4E0D;&#x53EA;&#x4E3A;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x670D;&#x52A1;&#xFF0C;&#x4E00;&#x822C;&#x4E3A;&#x5927;&#x91CF;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x51CF;&#x5C11;&#x76F8;&#x5E94;&#x65F6;&#x95F4;&#x548C;&#x5E26;&#x5BBD;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#x5F88;&#x6709;&#x6548;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x4F1A;&#x88AB;&#x91CD;&#x7528;&#x591A;&#x6B21;&#x3002;&#x5E38;&#x89C1;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x7F13;&#x5B58;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6709;Squid&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8BE6;&#x8FF0;&#x3002;</p>
<p>CDN&#xFF08;Content delivery networks&#xFF09;&#x7F13;&#x5B58;&#xFF0C;&#x4E5F;&#x53EB;&#x7F51;&#x5173;&#x7F13;&#x5B58;&#x3001;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x7F13;&#x5B58;&#x3002;CDN&#x7F13;&#x5B58;&#x4E00;&#x822C;&#x662F;&#x7531;&#x7F51;&#x7AD9;&#x7BA1;&#x7406;&#x5458;&#x81EA;&#x5DF1;&#x90E8;&#x7F72;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x4ED6;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;&#x66F4;&#x5BB9;&#x6613;&#x6269;&#x5C55;&#x5E76;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x5148;&#x5411;CDN&#x7F51;&#x5173;&#x53D1;&#x8D77;Web&#x8BF7;&#x6C42;&#xFF0C;&#x7F51;&#x5173;&#x670D;&#x52A1;&#x5668;&#x540E;&#x9762;&#x5BF9;&#x5E94;&#x7740;&#x4E00;&#x53F0;&#x6216;&#x591A;&#x53F0;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x6E90;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F1A;&#x6839;&#x636E;&#x5B83;&#x4EEC;&#x7684;&#x8D1F;&#x8F7D;&#x8BF7;&#x6C42;&#xFF0C;&#x52A8;&#x6001;&#x5C06;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x5230;&#x5408;&#x9002;&#x7684;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x7F13;&#x5B58;&#x6CA1;&#x6CD5;&#x5171;&#x4EAB;&#xFF0C;&#x4F46;&#x5374;&#x62E5;&#x6709;&#x66F4;&#x597D;&#x7684;&#x5904;&#x6269;&#x5C55;&#x6027;&#x3002;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6574;&#x4E2A;CDN&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6E90;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x6765;&#x8BF4;&#xFF0C;&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x7F13;&#x5B58;&#x673A;&#x5236;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x4E0B;&#x540C;&#x6837;&#x9002;&#x7528;&#x3002;</p>
</li>
<li><p>&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x7F13;&#x5B58;:&#x6839;&#x636E;&#x4E00;&#x5957;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7EA6;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x68C0;&#x67E5;&#x4E00;&#x6B21;&#x5E76;&#x786E;&#x5B9A;&#x7F13;&#x5B58;&#x7684;&#x526F;&#x672C;&#x8DB3;&#x591F;&#x65B0;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6D4F;&#x89C8;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x524D;&#x8FDB;&#x6216;&#x540E;&#x9000;&#xFF0C;&#x8BBF;&#x95EE;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x53EF;&#x4EE5;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;&#x4E2D;&#x8C03;&#x51FA;&#x800C;&#x5373;&#x65F6;&#x663E;&#x73B0;&#x3002;</p>
</li>
</ol>
<h3 id="&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x7F13;&#x5B58;"><a href="#&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x7F13;&#x5B58;" class="headerlink" title="&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x7F13;&#x5B58;"></a>&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x7F13;&#x5B58;</h3><h4 id="&#x7F13;&#x5B58;&#x539F;&#x7406;"><a href="#&#x7F13;&#x5B58;&#x539F;&#x7406;" class="headerlink" title="&#x7F13;&#x5B58;&#x539F;&#x7406;"></a><strong>&#x7F13;&#x5B58;&#x539F;&#x7406;</strong></h4><p> &#x5BF9;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x7684;&#x7F13;&#x5B58;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x662F;&#x5728;HTTP&#x534F;&#x8BAE;&#x5934;&#x548C;HTML&#x9875;&#x9762;&#x7684;Meta&#x6807;&#x7B7E;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x5206;&#x522B;&#x4ECE;&#x65B0;&#x9C9C;&#x5EA6;&#x548C;&#x6821;&#x9A8C;&#x503C;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x6765;&#x89C4;&#x5B9A;&#x6D4F;&#x89C8;&#x5668;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x53BB;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x53D6;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<p> &#x65B0;&#x9C9C;&#x5EA6;&#xFF08;&#x8FC7;&#x671F;&#x673A;&#x5236;&#xFF09;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x7F13;&#x5B58;&#x526F;&#x672C;&#x6709;&#x6548;&#x671F;&#x3002;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x526F;&#x672C;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x8BA4;&#x4E3A;&#x5B83;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x8DB3;&#x591F;&#x65B0;&#x7684;&#xFF1A;<br> 1.&#x542B;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x63A7;&#x5236;&#x5934;&#x4FE1;&#x606F;&#xFF08;HTTP&#x534F;&#x8BAE;&#x62A5;&#x5934;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4ECD;&#x5728;&#x6709;&#x6548;&#x671F;&#x5185;&#xFF1B;<br> 2.&#x6D4F;&#x89C8;&#x5668;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x8FC7;&#x8FD9;&#x4E2A;&#x7F13;&#x5B58;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x4E2D;&#x5DF2;&#x7ECF;&#x68C0;&#x67E5;&#x8FC7;&#x65B0;&#x9C9C;&#x5EA6;&#xFF1B;</p>
<p> &#x6EE1;&#x8DB3;&#x4EE5;&#x4E0A;&#x4E24;&#x4E2A;&#x60C5;&#x51B5;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x76F4;&#x63A5;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x83B7;&#x53D6;&#x526F;&#x672C;&#x5E76;&#x6E32;&#x67D3;&#x3002;</p>
<p> &#x6821;&#x9A8C;&#x503C;&#xFF08;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#xFF09;&#xFF1A;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x8D44;&#x6E90;&#x7684;&#x65F6;&#x5019;&#x6709;&#x65F6;&#x5728;&#x63A7;&#x5236;&#x5934;&#x4FE1;&#x606F;&#x5E26;&#x4E0A;&#x8FD9;&#x4E2A;&#x8D44;&#x6E90;&#x7684;&#x5B9E;&#x4F53;&#x6807;&#x7B7E;Etag&#xFF08;Entity Tag&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4F5C;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x518D;&#x6B21;&#x8BF7;&#x6C42;&#x8FC7;&#x7A0B;&#x7684;&#x6821;&#x9A8C;&#x6807;&#x8BC6;&#x3002;&#x5982;&#x8FC7;&#x53D1;&#x73B0;&#x6821;&#x9A8C;&#x6807;&#x8BC6;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x8BF4;&#x660E;&#x8D44;&#x6E90;&#x5DF2;&#x7ECF;&#x88AB;&#x4FEE;&#x6539;&#x6216;&#x8FC7;&#x671F;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x9700;&#x6C42;&#x91CD;&#x65B0;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x5185;&#x5BB9;&#x3002;</p>
<h4 id="&#x76F8;&#x5173;http&#x6D88;&#x606F;&#x62A5;&#x5934;"><a href="#&#x76F8;&#x5173;HTTP&#x6D88;&#x606F;&#x62A5;&#x5934;" class="headerlink" title="&#x76F8;&#x5173;HTTP&#x6D88;&#x606F;&#x62A5;&#x5934;"></a><strong>&#x76F8;&#x5173;HTTP&#x6D88;&#x606F;&#x62A5;&#x5934;</strong></h4><ol>
<li><p>Cache-Control&#x4E0E;Expires</p>
<p>Cache-Control&#x4E0E;Expires&#x7684;&#x4F5C;&#x7528;&#x4E00;&#x81F4;&#xFF0C;&#x90FD;&#x662F;&#x6307;&#x660E;&#x5F53;&#x524D;&#x8D44;&#x6E90;&#x7684;&#x6709;&#x6548;&#x671F;&#xFF0C;&#x63A7;&#x5236;&#x6D4F;&#x89C8;&#x5668;&#x662F;&#x5426;&#x76F4;&#x63A5;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;&#x53D6;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x91CD;&#x65B0;&#x53D1;&#x8BF7;&#x6C42;&#x5230;&#x670D;&#x52A1;&#x5668;&#x53D6;&#x6570;&#x636E;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;Cache-Control&#x7684;&#x9009;&#x62E9;&#x66F4;&#x591A;&#xFF0C;&#x8BBE;&#x7F6E;&#x66F4;&#x7EC6;&#x81F4;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x65F6;&#x8BBE;&#x7F6E;&#x7684;&#x8BDD;&#xFF0C;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x4E8E;Expires&#x3002;</p>
</li>
<li><p>Last-Modified/ETag&#x4E0E;Cache-Control/Expires</p>
<p>&#x914D;&#x7F6E;Last-Modified/ETag&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x518D;&#x6B21;&#x8BBF;&#x95EE;&#x7EDF;&#x4E00;URI&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8BE2;&#x95EE;&#x6587;&#x4EF6;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x4FEE;&#x6539;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x53EA;&#x53D1;&#x9001;&#x4E00;&#x4E2A;304&#x56DE;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x544A;&#x8BC9;&#x6D4F;&#x89C8;&#x5668;&#x76F4;&#x63A5;&#x4ECE;&#x81EA;&#x5DF1;&#x672C;&#x5730;&#x7684;&#x7F13;&#x5B58;&#x53D6;&#x6570;&#x636E;&#xFF1B;&#x5982;&#x679C;&#x4FEE;&#x6539;&#x8FC7;&#x90A3;&#x5C31;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x91CD;&#x65B0;&#x53D1;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#xFF1B;</p>
<p>Cache-Control/Expires&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230;&#x672C;&#x5730;&#x7684;&#x7F13;&#x5B58;&#x8FD8;&#x662F;&#x6709;&#x6548;&#x7684;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x526F;&#x672C;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D1;&#x9001;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#x3002;&#x4E24;&#x8005;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;Cache-Control/Expires&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x8981;&#x9AD8;&#x4E8E;Last-Modified/ETag&#x3002;&#x5373;&#x5F53;&#x672C;&#x5730;&#x526F;&#x672C;&#x6839;&#x636E;Cache-Control/Expires&#x53D1;&#x73B0;&#x8FD8;&#x5728;&#x6709;&#x6548;&#x671F;&#x5185;&#x65F6;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x53BB;&#x670D;&#x52A1;&#x5668;&#x8BE2;&#x95EE;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF08;Last-Modified&#xFF09;&#x6216;&#x5B9E;&#x4F53;&#x6807;&#x8BC6;&#xFF08;Etag&#xFF09;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;Cache-Control/Expires&#x4F1A;&#x914D;&#x5408;Last-Modified/ETag&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x670D;&#x52A1;&#x5668;&#x8BBE;&#x7F6E;&#x7F13;&#x5B58;&#x65F6;&#x95F4;, &#x5F53;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x201C;&#x5237;&#x65B0;&#x201D;&#x6309;&#x94AE;&#x65F6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5FFD;&#x7565;&#x7F13;&#x5B58;&#x7EE7;&#x7EED;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x65F6;Last-Modified/ETag&#x5C06;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5229;&#x7528;304&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x54CD;&#x5E94;&#x5F00;&#x9500;&#x3002;</p>
</li>
<li><p>Last-Modified&#x4E0E;ETag</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x4F7F;&#x7528;Last-Modified&#x5DF2;&#x7ECF;&#x8DB3;&#x4EE5;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x77E5;&#x9053;&#x672C;&#x5730;&#x7684;&#x7F13;&#x5B58;&#x526F;&#x672C;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x65B0;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x9700;&#x8981;Etag&#xFF08;&#x5B9E;&#x4F53;&#x6807;&#x8BC6;&#xFF09;&#x5462;&#xFF1F;HTTP1.1&#x4E2D;Etag&#x7684;&#x51FA;&#x73B0;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x51E0;&#x4E2A;Last-Modified&#x6BD4;&#x8F83;&#x96BE;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>Last-Modified&#x6807;&#x6CE8;&#x7684;&#x6700;&#x540E;&#x4FEE;&#x6539;&#x53EA;&#x80FD;&#x7CBE;&#x786E;&#x5230;&#x79D2;&#x7EA7;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x6587;&#x4EF6;&#x5728;1&#x79D2;&#x949F;&#x4EE5;&#x5185;&#xFF0C;&#x88AB;&#x4FEE;&#x6539;&#x591A;&#x6B21;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x5C06;&#x4E0D;&#x80FD;&#x51C6;&#x786E;&#x6807;&#x6CE8;&#x6587;&#x4EF6;&#x7684;&#x65B0;&#x9C9C;&#x5EA6;</li>
<li>&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x6587;&#x4EF6;&#x4F1A;&#x88AB;&#x5B9A;&#x671F;&#x751F;&#x6210;&#xFF0C;&#x5F53;&#x6709;&#x65F6;&#x5185;&#x5BB9;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53D8;&#x5316;&#xFF0C;&#x4F46;Last-Modified&#x5374;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x5BFC;&#x81F4;&#x6587;&#x4EF6;&#x6CA1;&#x6CD5;&#x4F7F;&#x7528;&#x7F13;&#x5B58;</li>
<li>&#x6709;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x5668;&#x6CA1;&#x6709;&#x51C6;&#x786E;&#x83B7;&#x53D6;&#x6587;&#x4EF6;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF0C;&#x6216;&#x8005;&#x4E0E;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x65F6;&#x95F4;&#x4E0D;&#x4E00;&#x81F4;&#x7B49;&#x60C5;&#x5F62;</li>
</ol>
<p>Etag&#x662F;&#x670D;&#x52A1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x6216;&#x8005;&#x7531;&#x5F00;&#x53D1;&#x8005;&#x751F;&#x6210;&#x7684;&#x5BF9;&#x5E94;&#x8D44;&#x6E90;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x51C6;&#x786E;&#x7684;&#x63A7;&#x5236;&#x7F13;&#x5B58;&#x3002;Last-Modified&#x4E0E;ETag&#x662F;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x4F18;&#x5148;&#x9A8C;&#x8BC1;ETag&#xFF0C;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x4F1A;&#x7EE7;&#x7EED;&#x6BD4;&#x5BF9;Last-Modified&#xFF0C;&#x6700;&#x540E;&#x624D;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x8FD4;&#x56DE;304&#x3002;Etag&#x7684;&#x670D;&#x52A1;&#x5668;&#x751F;&#x6210;&#x89C4;&#x5219;&#x548C;&#x5F3A;&#x5F31;Etag&#x7684;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF0C;&#x300A;&#x4E92;&#x52A8;&#x767E;&#x79D1;-Etag&#x300B;&#x548C;&#x300A;HTTP Header definition&#x300B;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x6DF1;&#x5165;&#x3002;</p>
<p>&#x5F53;&#x7528;&#x6237;&#x5728;&#x6309;F5&#x8FDB;&#x884C;&#x5237;&#x65B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5FFD;&#x7565;Expires/Cache-Control&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F1A;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x53BB;&#x670D;&#x52A1;&#x5668;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;Last-Modified/Etag&#x8FD8;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x6839;&#x636E;&#x60C5;&#x51B5;&#x5224;&#x65AD;&#x8FD4;&#x56DE;304&#x8FD8;&#x662F;200&#xFF1B;&#x800C;&#x5F53;&#x7528;&#x6237;&#x4F7F;&#x7528;Ctrl+F5&#x8FDB;&#x884C;&#x5F3A;&#x5236;&#x5237;&#x65B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x662F;&#x6240;&#x6709;&#x7684;&#x7F13;&#x5B58;&#x673A;&#x5236;&#x90FD;&#x5C06;&#x5931;&#x6548;&#xFF0C;&#x91CD;&#x65B0;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x62C9;&#x53BB;&#x8D44;&#x6E90;&#x3002;</p>
<p><img src="/images/&#x7F13;&#x5B58;&#x76F8;&#x5173;http&#x6D88;&#x606F;&#x62A5;&#x5934;.png" alt="&#x7F13;&#x5B58;&#x76F8;&#x5173;http&#x6D88;&#x606F;&#x62A5;&#x5934;"></p>
</li>
</ol>
<h4 id="&#x54EA;&#x4E9B;&#x8BF7;&#x6C42;&#x4E0D;&#x80FD;&#x88AB;&#x7F13;&#x5B58;"><a href="#&#x54EA;&#x4E9B;&#x8BF7;&#x6C42;&#x4E0D;&#x80FD;&#x88AB;&#x7F13;&#x5B58;" class="headerlink" title="&#x54EA;&#x4E9B;&#x8BF7;&#x6C42;&#x4E0D;&#x80FD;&#x88AB;&#x7F13;&#x5B58;"></a><strong>&#x54EA;&#x4E9B;&#x8BF7;&#x6C42;&#x4E0D;&#x80FD;&#x88AB;&#x7F13;&#x5B58;</strong></h4><ol>
<li>HTTP&#x4FE1;&#x606F;&#x5934;&#x4E2D;&#x5305;&#x542B;Cache-Control:no-cache&#xFF0C;pragma:no-cache&#xFF0C;&#x6216;Cache-Control:max-age=0&#x7B49;&#x544A;&#x8BC9;&#x6D4F;&#x89C8;&#x5668;&#x4E0D;&#x7528;&#x7F13;&#x5B58;&#x7684;&#x8BF7;&#x6C42;</li>
<li>&#x9700;&#x8981;&#x6839;&#x636E;Cookie&#xFF0C;&#x8BA4;&#x8BC1;&#x4FE1;&#x606F;&#x7B49;&#x51B3;&#x5B9A;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x7684;&#x52A8;&#x6001;&#x8BF7;&#x6C42;&#x662F;&#x4E0D;&#x80FD;&#x88AB;&#x7F13;&#x5B58;&#x7684;</li>
<li>&#x7ECF;&#x8FC7;HTTPS&#x5B89;&#x5168;&#x52A0;&#x5BC6;&#x7684;&#x8BF7;&#x6C42;&#xFF08;&#x6709;&#x4EBA;&#x4E5F;&#x7ECF;&#x8FC7;&#x6D4B;&#x8BD5;&#x53D1;&#x73B0;&#xFF0C;ie&#x5176;&#x5B9E;&#x5728;&#x5934;&#x90E8;&#x52A0;&#x5165;Cache-Control&#xFF1A;max-age&#x4FE1;&#x606F;&#xFF0C;firefox&#x5728;&#x5934;&#x90E8;&#x52A0;&#x5165;Cache-Control:Public&#x4E4B;&#x540E;&#xFF0C;&#x80FD;&#x591F;&#x5BF9;HTTPS&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#xFF0C;&#x53C2;&#x8003;&#x300A;HTTPS&#x7684;&#x4E03;&#x4E2A;&#x8BEF;&#x89E3;&#x300B;&#xFF09;</li>
<li>POST&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x88AB;&#x7F13;&#x5B58;</li>
<li>HTTP&#x54CD;&#x5E94;&#x5934;&#x4E2D;&#x4E0D;&#x5305;&#x542B;Last-Modified/Etag&#xFF0C;&#x4E5F;&#x4E0D;&#x5305;&#x542B;Cache-Control/Expires&#x7684;&#x8BF7;&#x6C42;&#x65E0;&#x6CD5;&#x88AB;&#x7F13;&#x5B58;</li>
</ol>
<h3 id="manifest-localstorage"><a href="#manifest-amp-amp-localStorage" class="headerlink" title="manifest &amp;&amp; localStorage"></a>manifest &amp;&amp; localStorage</h3><ol>
<li><p>HTML5&#x7684;Cache Manifest&#x79BB;&#x7EBF;&#x5E94;&#x7528;&#x7279;&#x6027;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x79BB;&#x7EBF;&#x4E5F;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x7AD9;&#x70B9;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x90FD;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF0C;&#x5F53;&#x7136;&#x524D;&#x63D0;&#x662F;&#x8981;&#x6C42;&#x5728;&#x8054;&#x7F51;&#x7684;&#x60C5;&#x5F62;&#x4E0B;&#x4F7F;&#x7528;&#x8FC7;&#x4E00;&#x6B21;&#x7AD9;&#x70B9;&#x3002;</p>
<p>manifest &#x5B9E;&#x73B0;&#x79BB;&#x7EBF;&#x8BBF;&#x95EE;&#x7279;&#x6027;:<br>1&#xFF09;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6DFB;&#x52A0;MIME TYPE&#x652F;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x80FD;&#x591F;&#x8BC6;&#x522B;manifest&#x540E;&#x7F00;&#x7684;&#x6587;&#x4EF6;<br>2&#xFF09;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540E;&#x7F00;&#x540D;&#x4E3A;.manifest&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x628A;&#x9700;&#x8981;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x6309;&#x683C;&#x5F0F;&#x5199;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x5E76;&#x7528;&#x6CE8;&#x91CA;&#x884C;&#x6807;&#x6CE8;&#x7248;&#x672C;<br>3&#xFF09;&#x7ED9; <html> &#x6807;&#x7B7E;&#x52A0; manifest &#x5C5E;&#x6027;&#xFF0C;&#x5E76;&#x5F15;&#x7528;manifest&#x6587;&#x4EF6;<br><code>&lt;html manifest=&#x201D;path/to/name-of.manifest&#x201D;&gt;</code></html></p>
<p>&#x79BB;&#x7EBF;&#x5E94;&#x7528;&#x8BBF;&#x95EE;&#x53CA;&#x66F4;&#x65B0;&#x6D41;&#x7A0B;<br>1.&#x7B2C;&#x4E00;&#x6B21;&#x8BBF;&#x95EE;&#x79BB;&#x7EBF;&#x5E94;&#x7528;&#x7684;&#x5165;&#x53E3;&#x9875;HTML&#xFF08;&#x5F15;&#x7528;&#x4E86;manifest&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x6B63;&#x5E38;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x83B7;&#x53D6;manifest&#x6587;&#x4EF6;&#x5E76;&#x5728;&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF0C;&#x9646;&#x7EED;&#x62C9;&#x53D6;manifest&#x4E2D;&#x7684;&#x9700;&#x8981;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x4EF6;<br>2.&#x518D;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x65E0;&#x6CD5;&#x5728;&#x7EBF;&#x79BB;&#x7EBF;&#x4E0E;&#x5426;&#xFF0C;&#x90FD;&#x4F1A;&#x76F4;&#x63A5;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x83B7;&#x53D6;&#x5165;&#x53E3;&#x9875;HTML&#x548C;&#x5176;&#x4ED6;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x5C55;&#x793A;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x5728;&#x7EBF;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8BF7;&#x6C42;manifest&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E0E;&#x7B2C;&#x4E00;&#x6B21;&#x8BBF;&#x95EE;&#x7684;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x6BD4;&#x5BF9;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x7248;&#x672C;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4F1A;&#x9646;&#x7EED;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x91CD;&#x65B0;&#x62C9;&#x53D6;&#x5165;&#x53E3;&#x6587;&#x4EF6;HTML&#x548C;&#x9700;&#x8981;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x5E76;&#x66F4;&#x65B0;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x526F;&#x672C;<br>3.&#x4E4B;&#x540E;&#x7684;&#x8BBF;&#x95EE;&#x91CD;&#x590D;&#x7B2C;2&#x6B65;&#x7684;&#x884C;&#x4E3A;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x4ECE;Manifest&#x7684;&#x673A;&#x5236;&#x6765;&#x770B;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x79BB;&#x7EBF;&#x5E94;&#x7528;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x7528;&#x4E8E;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x7ED9;Web&#x7F13;&#x5B58;&#x63D0;&#x4F9B;&#x591A;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7684;&#x9014;&#x5F84;&#x3002;</p>
<p>&#x7F3A;&#x70B9;&#xFF1A;&#x5C31;&#x76EE;&#x524D;HTML5&#x63D0;&#x4F9B;&#x7684;manifest&#x673A;&#x5236;&#x6765;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x53EA;&#x80FD;&#x5F15;&#x7528;&#x4E00;&#x4E2A;manifest&#x9875;&#x9762;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;manifest&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x91CC;&#x9762;&#x6240;&#x6709;&#x5B9A;&#x4E49;&#x7684;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5168;&#x90E8;&#x91CD;&#x65B0;&#x62C9;&#x53D6;&#x4E00;&#x904D;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x63A7;&#x5236;&#x6BD4;&#x8F83;&#x4E0D;&#x7075;&#x6D3B;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x6709;&#x7684;&#x540C;&#x5B66;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF0C;&#x6BD4;&#x5982;&#x628A;&#x9700;&#x8981;&#x7F13;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x5206;&#x6A21;&#x5757;&#x5207;&#x5206;&#x5230;&#x4E0D;&#x540C;manifest&#x4E2D;&#xFF0C;&#x5E76;&#x5206;&#x5F00;&#x7528;HTML&#x5F15;&#x7528;&#xFF0C;&#x518D;&#x4F7F;&#x7528;&#x5F3A;&#x5927;&#x7684;iframe&#x5D4C;&#x5165;&#x5230;&#x5165;&#x53E3;&#x9875;&#x9762;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F53;&#x67D0;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x9700;&#x8981;&#x6709;&#x66F4;&#x65B0;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x6587;&#x4EF6;&#x4E5F;&#x91CD;&#x65B0;&#x62C9;&#x53D6;&#x4E00;&#x904D;&#x3002;</p>
</li>
<li><p>HTML5&#x672C;&#x5730;&#x5B58;&#x50A8;localstorage&#x7279;&#x6027;&#xFF0C;&#x4E25;&#x683C;&#x6765;&#x8BB2;&#xFF0C;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x4E0D;&#x7B97;&#x4F20;&#x7EDF;Web&#x7F13;&#x5B58;&#x7684;&#x8303;&#x7574;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x5B58;&#x50A8;&#x7684;&#x5730;&#x65B9;&#x662F;&#x8DDF;Web&#x7F13;&#x5B58;&#x5206;&#x5F00;&#x7684;&#xFF0C;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x91CD;&#x65B0;&#x5F00;&#x8F9F;&#x7684;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
<p>localstorage&#x7684;&#x4F5C;&#x7528;&#xFF1A;<br>&#x672C;&#x5730;&#x5B58;&#x50A8;localstorage&#x7684;&#x4F5C;&#x7528;&#x4E3B;&#x8981;&#x4F7F;Web&#x9875;&#x9762;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6D4F;&#x89C8;&#x5668;&#x63D0;&#x4F9B;&#x7684;set/get&#x63A5;&#x53E3;&#xFF0C;&#x5B58;&#x50A8;&#x4E00;&#x4E9B;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#x5230;&#x672C;&#x5730;&#x786C;&#x76D8;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5355;&#x6B21;&#x8BBF;&#x95EE;&#x6216;&#x4EE5;&#x540E;&#x7684;&#x8BBF;&#x95EE;&#x8FC7;&#x7A0B;&#x4E2D;&#x968F;&#x65F6;&#x83B7;&#x53D6;&#x6216;&#x4FEE;&#x6539;&#x3002;&#x63D0;&#x4F9B;&#x4E86;&#x51E0;&#x4E2A;&#x975E;&#x5E38;&#x6613;&#x7528;&#x7684;Api&#xFF0C;setItem/getItem/removeItem/clear&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF1A;Html5 Step by Step(&#x4E8C;) &#x672C;&#x5730;&#x5B58;&#x50A8; &#x3002;Localstorage&#x8BBE;&#x8BA1;&#x7684;&#x672C;&#x610F;&#x53EF;&#x80FD;&#x662F;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x4E00;&#x4E9B;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x7684;&#x4E2A;&#x6027;&#x5316;&#x8BBE;&#x7F6E;&#x7684;&#x6587;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x6570;&#x636E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x4E5F;&#x53EF;&#x80FD;&#x62FF;&#x6765;&#x5F53;Web&#x7F13;&#x5B58;&#x533A;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;Base64&#x683C;&#x5F0F;&#x7F16;&#x7801;&#x7684;&#x56FE;&#x7247;&#x4FE1;&#x606F;&#xFF0C;&#x5B58;&#x5728;localstorage&#x4E2D;&#xFF0C;&#x518D;&#x6B21;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x76F4;&#x63A5;&#x672C;&#x5730;&#x83B7;&#x53D6;&#x540E;&#xFF0C;&#x4F7F;&#x7528;Css3&#x7684;Data:image&#x7684;&#x65B9;&#x5F0F;&#x76F4;&#x63A5;&#x5C55;&#x73B0;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x7F3A;&#x70B9;&#xFF1A;&#x5927;&#x5C0F;&#x9650;&#x5236;&#xFF0C;&#x6309;&#x7167;&#x76EE;&#x524D;&#x6807;&#x51C6;&#xFF0C;&#x76EE;&#x524D;&#x6D4F;&#x89C8;&#x5668;&#x53EA;&#x7ED9;&#x6BCF;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x57DF;&#x540D;&#x63D0;&#x4F9B;5m&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x5F53;&#x5B58;&#x50A8;&#x8D85;&#x8FC7;5m&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x4F1A;&#x5F39;&#x51FA;&#x8B66;&#x544A;&#x6846;&#x3002;</p>
</li>
</ol>
<hr>
<p><strong>&#x53C2;&#x8003;</strong></p>
<ul>
<li><a href="http://www.alloyteam.com/2012/03/web-cache-2-browser-cache/" target="_blank" rel="external">Web&#x7F13;&#x5B58;&#x673A;&#x5236;</a></li>
</ul>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/12/22/前端模块化/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          前端模块化
        
      </div>
    </a>
  
  
    <a href="/2016/11/20/React-Webpack/" id="article-nav-older" class="article-nav-link-wrap">
        <div class="article-nav-title">Webpack</div>
        <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>

  
</article>


<div class="share">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">分享到：</span>
		<a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
		<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>



<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="Web-缓存" data-title="Web 缓存" data-url="http://yoursite.com/2016/12/06/Web-缓存/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"aqua0706"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>




      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017 草 + 酱
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten, modified by <a href="http://natumsol.github.com">Yoghurt</a>
      	</div>
    </div>
  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>
  <script src="/js/main.js"></script>

  </div>
</body>
</html>