<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>CSS 清除浮动 | 草 + 酱</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="浮动的原理float属性定义元素在哪个方向浮动。以往这个属性总应用于图像，使文本围绕在图像周围，不过在 CSS 中，任何元素都可以浮动。浮动元素会生成一个块级框，而不论它本身是何种元素。float:right|left|none|inherit
浮动的框可以向左或向右移动，直到它的外边缘碰到包含它的框或另一个浮动块的边框为止。由于浮动框不在文档的普通流中，所以文档的普通流中的块框表现得就像浮动框不">
<meta property="og:type" content="article">
<meta property="og:title" content="CSS 清除浮动">
<meta property="og:url" content="http://yoursite.com/2016/07/06/CSS-清除浮动/index.html">
<meta property="og:site_name" content="草 + 酱">
<meta property="og:description" content="浮动的原理float属性定义元素在哪个方向浮动。以往这个属性总应用于图像，使文本围绕在图像周围，不过在 CSS 中，任何元素都可以浮动。浮动元素会生成一个块级框，而不论它本身是何种元素。float:right|left|none|inherit
浮动的框可以向左或向右移动，直到它的外边缘碰到包含它的框或另一个浮动块的边框为止。由于浮动框不在文档的普通流中，所以文档的普通流中的块框表现得就像浮动框不">
<meta property="og:updated_time" content="2017-02-15T03:16:35.314Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="CSS 清除浮动">
<meta name="twitter:description" content="浮动的原理float属性定义元素在哪个方向浮动。以往这个属性总应用于图像，使文本围绕在图像周围，不过在 CSS 中，任何元素都可以浮动。浮动元素会生成一个块级框，而不论它本身是何种元素。float:right|left|none|inherit
浮动的框可以向左或向右移动，直到它的外边缘碰到包含它的框或另一个浮动块的边框为止。由于浮动框不在文档的普通流中，所以文档的普通流中的块框表现得就像浮动框不">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/css/style.css">
  <script src="http://libs.baidu.com/jquery/1.9.0/jquery.js"></script>
</head>
<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<div class="profilepic">
			<img src="/avatar.jpg">
		</div>

		<hgroup>
		  <h1 class="header-author"><a href="/">草 + 酱</a></h1>
		</hgroup>

		
		<p class="header-subtitle">如果说真实是残酷的，谎言绝对是温柔的吧。</p>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">所有文章</a></li>
				        
							<li><a href="/projects">项目</a></li>
				        
							<li><a href="/about">关于</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="https://github.com/Ariel-Cheng" title="github">github</a>
					        
								<a class="weibo" target="_blank" href="http://weibo.com/u/3267066875/" title="weibo">weibo</a>
					        
						</div>
					</nav>
				</section>
				
			</div>
		</div>
	</header>		
</span>		
</div>
    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay"></div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				<img src="/avatar.jpg">
			</div>

			<hgroup>
			  <h1 class="header-author"><a href="/">草 + 酱</a></h1>
			</hgroup>
			
			<p class="header-subtitle">如果说真实是残酷的，谎言绝对是温柔的吧。</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
					<li><a href="/projects">项目</a></li>
		        
					<li><a href="/about">关于</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/Ariel-Cheng" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="http://weibo.com/u/3267066875/" title="weibo">weibo</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>
      <article id="post-CSS-清除浮动" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/07/06/CSS-清除浮动/" class="article-date">
  	<time datetime="2016-07-06T13:52:01.000Z" itemprop="datePublished">Jul 06</time>
</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/CSS-清除浮动/">CSS 清除浮动</a></li></ul>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      CSS 清除浮动
    </h1>
  

        
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
      
        <div class="toc-container">
          <strong class="toc-title">文章目录</strong>
          <ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#浮动的原理"><span class="toc-number">1.</span> <span class="toc-text">浮动的原理</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#清除浮动的方式"><span class="toc-number">2.</span> <span class="toc-text">清除浮动的方式</span></a></li></ol>
        </div>      
      
        <h3 id="&#x6D6E;&#x52A8;&#x7684;&#x539F;&#x7406;"><a href="#&#x6D6E;&#x52A8;&#x7684;&#x539F;&#x7406;" class="headerlink" title="&#x6D6E;&#x52A8;&#x7684;&#x539F;&#x7406;"></a>&#x6D6E;&#x52A8;&#x7684;&#x539F;&#x7406;</h3><p><code>float</code>&#x5C5E;&#x6027;&#x5B9A;&#x4E49;&#x5143;&#x7D20;&#x5728;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#x6D6E;&#x52A8;&#x3002;&#x4EE5;&#x5F80;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x603B;&#x5E94;&#x7528;&#x4E8E;&#x56FE;&#x50CF;&#xFF0C;&#x4F7F;&#x6587;&#x672C;&#x56F4;&#x7ED5;&#x5728;&#x56FE;&#x50CF;&#x5468;&#x56F4;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728; CSS &#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x90FD;&#x53EF;&#x4EE5;&#x6D6E;&#x52A8;&#x3002;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5757;&#x7EA7;&#x6846;&#xFF0C;&#x800C;&#x4E0D;&#x8BBA;&#x5B83;&#x672C;&#x8EAB;&#x662F;&#x4F55;&#x79CD;&#x5143;&#x7D20;&#x3002;<code>float:right|left|none|inherit</code></p>
<p>&#x6D6E;&#x52A8;&#x7684;&#x6846;&#x53EF;&#x4EE5;&#x5411;&#x5DE6;&#x6216;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x7684;&#x5916;&#x8FB9;&#x7F18;&#x78B0;&#x5230;&#x5305;&#x542B;&#x5B83;&#x7684;&#x6846;&#x6216;&#x53E6;&#x4E00;&#x4E2A;&#x6D6E;&#x52A8;&#x5757;&#x7684;&#x8FB9;&#x6846;&#x4E3A;&#x6B62;&#x3002;&#x7531;&#x4E8E;&#x6D6E;&#x52A8;&#x6846;&#x4E0D;&#x5728;&#x6587;&#x6863;&#x7684;&#x666E;&#x901A;&#x6D41;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x6587;&#x6863;&#x7684;&#x666E;&#x901A;&#x6D41;&#x4E2D;&#x7684;&#x5757;&#x6846;&#x8868;&#x73B0;&#x5F97;&#x5C31;&#x50CF;&#x6D6E;&#x52A8;&#x6846;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x6837;&#x3002;&#x6D6E;&#x52A8;&#x6846;&#x65C1;&#x8FB9;&#x7684;&#x884C;&#x6846;&#x88AB;&#x7F29;&#x77ED;&#xFF0C;&#x4ECE;&#x800C;&#x7ED9;&#x6D6E;&#x52A8;&#x6846;&#x7559;&#x51FA;&#x7A7A;&#x95F4;&#xFF0C;&#x884C;&#x6846;&#x56F4;&#x7ED5;&#x6D6E;&#x52A8;&#x6846;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x521B;&#x5EFA;&#x6D6E;&#x52A8;&#x6846;&#x53EF;&#x4EE5;&#x4F7F;&#x6587;&#x672C;&#x56F4;&#x7ED5;&#x56FE;&#x50CF;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x6D6E;&#x52A8;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5757;&#x7EA7;&#x6846;&#x7684;&#x5E03;&#x5C40;&#x800C;&#x53EA;&#x4F1A;&#x5F71;&#x54CD;&#x5185;&#x8054;&#x6846;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x6587;&#x672C;&#xFF09;&#x7684;&#x6392;&#x5217;&#x3002;<br><a id="more"></a><br>&#x6D6E;&#x52A8;&#x51FA;&#x73B0;&#x7684;&#x610F;&#x4E49;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x7528;&#x6765;&#x8BA9;&#x6587;&#x5B57;&#x73AF;&#x7ED5;&#x56FE;&#x7247;&#x3002;&#x56FE;&#x7247;&#x672C;&#x8EAB;&#x4E00;&#x4E2A;<code>inline boxes</code>&#xFF0C;&#x56FE;&#x7247;&#x4E0E;&#x6587;&#x5B57;&#x57FA;&#x7EBF;&#x5BF9;&#x9F50;&#xFF0C;&#x56FE;&#x7247;&#x4E0E;&#x6587;&#x5B57;&#x5728;&#x540C;&#x4E00;&#x884C;&#x4E0A;&#x3002;&#x6D6E;&#x52A8;&#x7834;&#x574F;&#x4E86;&#x6B63;&#x5E38;&#x7684;<code>line boxes</code>&#xFF0C;&#x7531;&#x4E8E;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x4E86;<code>inline boxes</code>&#xFF0C;&#x6CA1;&#x6709;&#x4E86;<code>inline boxes</code>&#x9AD8;&#x5EA6;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x5176;&#x4ED6;<code>inline boxes</code>&#x5143;&#x7D20;&#x91CD;&#x65B0;&#x6574;&#x5408;&#xFF0C;&#x73AF;&#x7ED5;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x6392;&#x5217;&#x3002;&#x201C;&#x5305;&#x88F9;&#x4E0E;&#x7834;&#x574F;&#x201D;(inlinebox&#x53E0;&#x52A0;&#x6210;linebox&#x7684;&#x9AD8;&#x5EA6;,&#x884C;&#x6846;&#x4E0E;&#x884C;&#x5185;&#x6846;(&#x89C1;&#x5370;&#x8C61;&#x7B14;&#x8BB0;))</p>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x6F02;&#x6D6E;&#x4E8E;&#x666E;&#x901A;&#x6D41;&#x4E4B;&#x4E0A;&#xFF0C;&#x50CF;&#x6D6E;&#x4E91;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x5DE6;&#x53F3;&#x6D6E;&#x52A8;&#x3002;&#x7ED9;&#x5143;&#x7D20;&#x7684;float&#x5C5E;&#x6027;&#x8D4B;&#x503C;&#x540E;&#xFF0C;&#x5C31;&#x662F;&#x8131;&#x79BB;&#x6587;&#x6863;&#x6D41;&#xFF0C;&#x8FDB;&#x884C;&#x5DE6;&#x53F3;&#x6D6E;&#x52A8;&#xFF0C;&#x7D27;&#x8D34;&#x7740;&#x7236;&#x5143;&#x7D20;(&#x9ED8;&#x8BA4;&#x4E3A;body&#x6587;&#x672C;&#x533A;&#x57DF;)&#x7684;&#x5DE6;&#x53F3;&#x8FB9;&#x6846;&#x3002;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x5728;&#x6587;&#x6863;&#x6D41;&#x7A7A;&#x51FA;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7531;&#x540E;&#x7EED;&#x7684;(&#x975E;&#x6D6E;&#x52A8;)&#x5143;&#x7D20;&#x586B;&#x5145;&#x4E0A;&#x53BB;&#xFF1A;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x76F4;&#x63A5;&#x586B;&#x5145;&#x4E0A;&#x53BB;&#xFF0C;&#x82E5;&#x8DDF;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x7684;&#x8303;&#x56F4;&#x53D1;&#x751F;&#x91CD;&#x53E0;&#xFF0C;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x8986;&#x76D6;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x3002;&#x6D6E;&#x52A8;&#x4F1A;&#x8986;&#x76D6;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x3002;&#x5185;&#x8054;&#x5143;&#x7D20;&#xFF1A;&#x6709;&#x7A7A;&#x9699;&#x5C31;&#x63D2;&#x5165;&#x3002;&#x73AF;&#x7ED5;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x88AB;&#x8986;&#x76D6;&#x3002;</p>
<h3 id="&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x7684;&#x65B9;&#x5F0F;"><a href="#&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x7684;&#x65B9;&#x5F0F;" class="headerlink" title="&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x7684;&#x65B9;&#x5F0F;"></a>&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x7684;&#x65B9;&#x5F0F;</h3><p>&#x901A;&#x8FC7;&#x6D6E;&#x52A8;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x5E03;&#x5C40;,&#x4F46;&#x6709;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x7684;&#x95EE;&#x9898;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x3002;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x666E;&#x901A;&#x6D41;&#x5C31;&#x4F1A;&#x8868;&#x73B0;&#x5F97;&#x548C;&#x6D6E;&#x52A8;&#x6846;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x5305;&#x542B;&#x6846;&#x592A;&#x7A84;&#xFF0C;&#x65E0;&#x6CD5;&#x5BB9;&#x7EB3;&#x6C34;&#x5E73;&#x6392;&#x5217;&#x7684;&#x4E09;&#x4E2A;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x5B83;&#x6D6E;&#x52A8;&#x5757;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x5982;&#x679C;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x5B83;&#x4EEC;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#x65F6;&#x53EF;&#x80FD;&#x88AB;&#x5176;&#x5B83;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x201C;&#x5361;&#x4F4F;&#x201D;&#x3002;&#x5F53;&#x6D6E;&#x52A8;&#x6846;&#x9AD8;&#x5EA6;&#x8D85;&#x51FA;&#x5305;&#x542B;&#x6846;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x5305;&#x542B;&#x6846;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x4F38;&#x9AD8;&#x6765;&#x95ED;&#x5408;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF08;&#x201C;&#x9AD8;&#x5EA6;&#x584C;&#x9677;&#x201D;&#x73B0;&#x8C61;&#xFF09;&#x3002;<code>&#x5143;&#x7D20;&#x542B;&#x6709;&#x6D6E;&#x52A8;&#x5C5E;&#x6027; &#x2013; &#x7834;&#x574F;inline box &#x2013; &#x7834;&#x574F;line box&#x9AD8;&#x5EA6; &#x2013; &#x6CA1;&#x6709;&#x9AD8;&#x5EA6; &#x2013; &#x584C;&#x9677;</code></p>
<p>&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6D6E;&#x52A8;&#x7684;&#x8FD9;&#x79CD;&#x7279;&#x6027;&#xFF0C;&#x5BFC;&#x81F4;&#x672C;&#x5C5E;&#x4E8E;&#x666E;&#x901A;&#x6D41;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6D6E;&#x52A8;&#x4E4B;&#x540E;&#xFF0C;&#x5305;&#x542B;&#x6846;&#x5185;&#x90E8;&#x7531;&#x4E8E;&#x4E0D;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x666E;&#x901A;&#x6D41;&#x5143;&#x7D20;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x8868;&#x73B0;&#x51FA;&#x9AD8;&#x5EA6;&#x4E3A;0&#xFF08;&#x9AD8;&#x5EA6;&#x584C;&#x9677;&#xFF1A;&#x7236;&#x5143;&#x7D20;&#x53EA;&#x5305;&#x542B;&#x6D6E;&#x52A8;&#x5143;&#x7D20;,&#x4E14;&#x7236;&#x5143;&#x7D20;&#x672A;&#x8BBE;&#x7F6E;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#xFF09;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5E03;&#x5C40;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x5E0C;&#x671B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x95ED;&#x5408;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF0C;&#x4F7F;&#x5176;&#x5305;&#x542B;&#x6846;&#x8868;&#x73B0;&#x51FA;&#x6B63;&#x5E38;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x963B;&#x6B62;&#x884C;&#x6846;&#x56F4;&#x7ED5;&#x6D6E;&#x52A8;&#x6846;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8BE5;&#x6846;&#x5E94;&#x7528;<code>clear</code>&#x5C5E;&#x6027;&#x3002;<code>clear</code>&#x5C5E;&#x6027;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x662F;<code>left&#x3001;right&#x3001;both &#x6216; none</code>&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x6846;&#x7684;&#x54EA;&#x4E9B;&#x8FB9;&#x4E0D;&#x5E94;&#x8BE5;&#x6328;&#x7740;&#x6D6E;&#x52A8;&#x6846;&#x3002;<code>clear&#xFF1A;left | right | both | none&#xFF1B;</code>&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x201C;&#x9AD8;&#x5EA6;&#x584C;&#x9677;&#x201D;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>IE&#x4E0B;&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x51C6;&#x5219;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F7F;&#x5143;&#x7D20;haslayout&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x5982;&#x5BBD;&#x5EA6;&#x503C;&#xFF0C;&#x9AD8;&#x5EA6;&#x503C;&#xFF0C;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;zoom&#xFF0C;&#x6D6E;&#x52A8;&#x672C;&#x8EAB;&#x90FD;&#x53EF;&#x4EE5;&#x8BA9;&#x5143;&#x7D20;haslayout&#x3002;&#x663E;&#x7136;&#xFF0C; &#x9996;&#x9009;zoom:1;&#x4E0D;&#x4F1A;&#x5E72;&#x6270;&#x4EFB;&#x4F55;&#x6837;&#x5F0F;&#x3002;&#x975E;IE&#x6D4F;&#x89C8;&#x5668;&#x5E38;&#x7528;&#x7684;&#x662F;overflow&#x5C5E;&#x6027;&#xFF0C;overflow:hidden;&#x6216;&#x662F;overflow:scroll&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x4E0D;&#x8FC7;&#x7531;&#x4E8E;&#x540E;&#x8005;&#x7ECF;&#x5E38;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x51FA;&#x73B0;&#x6EDA;&#x52A8;&#x6761;&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x8005;&#x7528;&#x7684;&#x66F4;&#x591A;&#x4E9B;&#x3002;&#x7531;&#x4E8E;&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x652F;&#x6301;after&#x4F2A;&#x7C7B;&#xFF0C;&#x6240;&#x4EE5;&#x5E38;&#x5E38;&#x4E5F;&#x4F1A;&#x7528;after&#x5199;&#x5165;&#x4E00;&#x4E2A;clear&#x5C5E;&#x6027;&#x7684;&#x5143;&#x7D20;&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x6295;&#x673A;&#x53D6;&#x5DE7;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x4E00;&#x4E2A;&#x653E;&#x5230;&#x5F53;&#x4F5C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x6807;&#x7B7E;&#x653E;&#x5230;&#x7236;&#x6807;&#x7B7E;&#x90A3;&#x513F;&#x3002;</p>
<ol>
<li><p>&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x6807;&#x7B7E;<br>&#x901A;&#x8FC7;&#x5728;float&#x5143;&#x7D20;&#x7684;&#x7236;&#x5143;&#x7D20;&#x7ED3;&#x675F;&#x524D;&#x52A0;&#x4E00;&#x4E2A;&#x9AD8;&#x4E3A;0&#x5BBD;&#x4E3A;0&#x4E14;&#x6709;clear:both&#x6837;&#x5F0F;&#x7684;&#x5143;&#x7D20;&#x3002;&#x4F8B;&#x5982;<div style="&#x201D;clear:both&#x201D;"></div>&#xFF0C;&#x5176;&#x4ED6;&#x6807;&#x7B7E;br&#x7B49;&#x4EA6;&#x53EF;&#x3002;<br>&#x4F18;&#x70B9;&#xFF1A;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#xFF0C;&#x5BB9;&#x6613;&#x638C;&#x63E1;;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x4F1A;&#x6DFB;&#x52A0;&#x591A;&#x5C11;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x7A7A;&#x6807;&#x7B7E;&#xFF0C;&#x6709;&#x8FDD;&#x7ED3;&#x6784;&#x4E0E;&#x8868;&#x73B0;&#x7684;&#x5206;&#x79BB;&#xFF0C;&#x5728;&#x540E;&#x671F;&#x7EF4;&#x62A4;&#x4E2D;&#x5C06;&#x662F;&#x5669;&#x68A6;&#x3002;</p>
<figure class="highlight html"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="tag">&lt;<span class="name">div</span> <span class="attr">class</span>=<span class="string">&quot;wrap&quot;</span> <span class="attr">id</span>=<span class="string">&quot;float1&quot;</span>&gt;</span></span><br><span class="line">  <span class="tag">&lt;<span class="name">div</span> <span class="attr">class</span>=<span class="string">&quot;main left&quot;</span>&gt;</span>.main{float:left;}<span class="tag">&lt;/<span class="name">div</span>&gt;</span></span><br><span class="line">  <span class="tag">&lt;<span class="name">div</span> <span class="attr">class</span>=<span class="string">&quot;side left&quot;</span>&gt;</span>.side{float:right;}<span class="tag">&lt;/<span class="name">div</span>&gt;</span></span><br><span class="line">  <span class="tag">&lt;<span class="name">div</span> <span class="attr">style</span>=<span class="string">&quot;clear:both;&quot;</span>&gt;</span><span class="tag">&lt;/<span class="name">div</span>&gt;</span></span><br><span class="line"><span class="tag">&lt;/<span class="name">div</span>&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">div</span> <span class="attr">class</span>=<span class="string">&quot;footer&quot;</span>&gt;</span>.footer<span class="tag">&lt;/<span class="name">div</span>&gt;</span></span><br></pre></td></tr></table></figure>
</li>
<li><p>&#x7236;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;<code>overflow:hidden,zoom:1</code><br>overflow:hidden&#x5C5E;&#x6027;&#x4F1A;&#x5F3A;&#x5236;&#x7236;&#x7EA7;&#x5143;&#x7D20;&#x6269;&#x5927;&#x5230;&#x5305;&#x542B;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF0C;zoom:1&#x53EA;&#x662F;&#x89E6;&#x53D1;ie6&#x7684;hasLayout&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;<br><code>.fix{overflow:hidden; zoom:1;}</code><br>&#x4F18;&#x70B9;&#xFF1A;&#x4EE3;&#x7801;&#x7B80;&#x6D01;&#xFF0C;&#x6DB5;&#x76D6;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;;<br>&#x7F3A;&#x70B9;&#xFF1A;overflow:hidden;&#x662F;&#x4E2A;&#x5C0F;&#x70B8;&#x86CB;&#xFF0C;&#x8981;&#x662F;&#x91CC;&#x9762;&#x7684;&#x5143;&#x7D20;&#x8981;&#x662F;&#x60F3;&#x6765;&#x4E2A;margin&#x8D1F;&#x503C;&#x5B9A;&#x4F4D;&#x6216;&#x662F;&#x8D1F;&#x7684;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;&#x5C82;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x88AB;&#x88C1;&#x6389;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6B64;&#x65B9;&#x6CD5;&#x662F;&#x6709;&#x4E0D;&#x5C0F;&#x7684;&#x5C40;&#x9650;&#x6027;&#x7684;&#x3002;</p>
</li>
<li><p>&#x7236;&#x5143;&#x7D20;&#x4E5F;&#x8BBE;&#x7F6E;&#x6D6E;&#x52A8;<br>&#x6D6E;&#x52A8;&#x7236;&#x7EA7;&#x5143;&#x7D20;&#xFF0C;&#x7236;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#x5C31;&#x4F1A;&#x6269;&#x5927;&#xFF0C;&#x76F4;&#x5230;&#x5B8C;&#x5168;&#x5305;&#x542B;&#x5B83;&#x91CC;&#x9762;&#x7684;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x8BE5;&#x7236;&#x5143;&#x7D20;&#x7684;&#x4E0B;&#x4E2A;&#x540C;&#x8F88;&#x5143;&#x7D20;&#x6DFB;&#x52A0;clear:both,&#x786E;&#x4FDD;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x843D;&#x5230;&#x7236;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#x4E0B;&#x65B9;&#x3002;<br>&#x4F18;&#x70B9;&#xFF1A;&#x4E0D;&#x5B58;&#x5728;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x4E49;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x4EE3;&#x7801;&#x91CF;&#x6781;&#x5C11;;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x4F7F;&#x5F97;&#x4E0E;&#x7236;&#x5143;&#x7D20;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x7684;&#x5E03;&#x5C40;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x4E00;&#x76F4;&#x6D6E;&#x52A8;&#x5230;body&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x3002;</p>
</li>
<li><p>&#x4F7F;&#x7528;:after &#x4F2A;&#x5143;&#x7D20;</p>
<figure class="highlight css"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line"><span class="selector-class">.fix</span>{<span class="attribute">zoom</span>:<span class="number">1</span>;}</span><br><span class="line"><span class="selector-class">.fix</span><span class="selector-pseudo">:after</span>{<span class="attribute">display</span>:block; <span class="attribute">content</span>:<span class="string">&apos;clear&apos;</span>; <span class="attribute">clear</span>:both; <span class="attribute">line-height</span>:<span class="number">0</span>; <span class="attribute">visibility</span>:hidden;}</span><br></pre></td></tr></table></figure>
</li>
</ol>
<p>after&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x6807;&#x7B7E;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x540E;&#x9762;&#x3002;&#x4E8E;&#x662F;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;CSS&#x4EE3;&#x7801;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5177;&#x6709;clear&#x5C5E;&#x6027;&#x7684;&#x5143;&#x7D20;&#xFF0C; &#x4F18;&#x70B9;&#xFF1A;&#x4E0D;&#x5B58;&#x5728;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x4E49;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x4EE3;&#x7801;&#x91CF;&#x6781;&#x5C11;;<br>&#x7F3A;&#x70B9;&#xFF1A;&#x4F7F;&#x5F97;&#x4E0E;&#x7236;&#x5143;&#x7D20;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x7684;&#x5E03;&#x5C40;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x4E00;&#x76F4;&#x6D6E;&#x52A8;&#x5230;body&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="http://www.iyunlu.com/view/css-xhtml/55.html" target="_blank" rel="external">&#x90A3;&#x4E9B;&#x5E74;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6E05;&#x9664;&#x8FC7;&#x7684;&#x6D6E;&#x52A8;</a></li>
<li><a href="http://www.zhangxinxu.com/wordpress/2010/01/css-float%E6%B5%AE%E5%8A%A8%E7%9A%84%E6%B7%B1%E5%85%A5%E7%A0%94%E7%A9%B6%E3%80%81%E8%AF%A6%E8%A7%A3%E5%8F%8A%E6%8B%93%E5%B1%95%E4%B8%80/" target="_blank" rel="external">CSS float&#x6D6E;&#x52A8;&#x7684;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x3001;&#x8BE6;&#x89E3;&#x53CA;&#x62D3;&#x5C55;(&#x4E00;)</a></li>
</ul>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/07/13/JS学习笔记之闭包/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">&lt;</strong>
      <div class="article-nav-title">
        
          JS学习笔记之闭包
        
      </div>
    </a>
  
  
    <a href="/2016/06/06/You-Don-t-Know-JS-Async-Performance2/" id="article-nav-older" class="article-nav-link-wrap">
        <div class="article-nav-title">You Don&#39;t Know JS读书笔记之Promise</div>
        <strong class="article-nav-caption">&gt;</strong>
    </a>
  
</nav>

  
</article>


<div class="share">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">分享到：</span>
		<a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
		<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>



<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="CSS-清除浮动" data-title="CSS 清除浮动" data-url="http://yoursite.com/2016/07/06/CSS-清除浮动/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"aqua0706"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>




      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017 草 + 酱
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten, modified by <a href="http://natumsol.github.com">Yoghurt</a>
      	</div>
    </div>
  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>
  <script src="/js/main.js"></script>

  </div>
</body>
</html>